# GetVendorId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalServer..::..GetVendorId Method
IExternalServer Interface See Also
---
Implement this method to return the id of the vendor of the server.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
string GetVendorId()
```

Visual Basic
---
```text
Function GetVendorId As String
```

Visual C++
---
```text
String^ GetVendorId()
```

# ### Return Value
Vendor Id of the server.
# Remarks
The Id is expected to be a string consisting of 4 characters.
# See Also
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace